# Show Method (String, String, TaskDialogCommonButtons) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TaskDialog..::..Show Method (String, String, TaskDialogCommonButtons)
TaskDialog Class See Also
---
Shows a task dialog with title, main instruction and common buttons.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static TaskDialogResult Show(
	string title,
	string mainInstruction,
	TaskDialogCommonButtons buttons
)
```

Visual Basic
---
```text
Public Shared Function Show ( _
	title As String, _
	mainInstruction As String, _
	buttons As TaskDialogCommonButtons _
) As TaskDialogResult
```

Visual C++
---
```text
public:
static TaskDialogResult Show(
	String^ title,
	String^ mainInstruction,
	TaskDialogCommonButtons buttons
)
```

# ### Parameters
title
    Type: System..::..String The title of the task dialog.
mainInstruction
    Type: System..::..String The main instruction of the task dialog.
buttons
    Type: Autodesk.Revit.UI..::..TaskDialogCommonButtons The common buttons to be shown the task dialog.
# ### Return Value
The user's response to the task dialog.
# See Also
TaskDialog Class
Show Overload
Autodesk.Revit.UI Namespace